//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**           5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093      **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
/=#
#include "VFR.uni"

#string STR_CSM_FORM                    #language eng "CSM16 Parameters"
#string STR_CSM_FORM_HELP               #language eng "CSM16 configuration: Enable/Disable, Option ROM execution settings, etc."
#string STR_CSM_OPROM_DISPLAY_MODE      #language eng "Option ROM Messages"
#string STR_CSM_OPROM_DISPLAY_MODE_HELP     #language eng "Set display mode for Option ROM"
#string STR_CSM_OPROM_DISPLAY_FORCE_BIOS    #language eng "Force BIOS"
#string STR_CSM_OPROM_DISPLAY_KEEP_CURRENT  #language eng "Keep Current"
#string STR_CSM_I19_TRAP                #language eng "INT19 Trap Response"
#string STR_CSM_I19_TRAP_IMMEDIATE      #language eng "Immediate"
#string STR_CSM_I19_TRAP_POSTPONED      #language eng "Postponed"
#string STR_CSM_I19_TRAP_HELP           #language eng "BIOS reaction on INT19 trapping by Option ROM: IMMEDIATE - execute the trap right away; POSTPONED - execute the trap during legacy boot."

#string STR_CSM_GA20_ACTIVE             #language eng "GateA20 Active"
#string STR_CSM_GA20_ACTIVE_UPONREQUEST #language eng "Upon Request"
#string STR_CSM_GA20_ACTIVE_ALWAYS      #language eng "Always"
#string STR_CSM_GA20_ACTIVE_HELP        #language eng "UPON REQUEST - GA20 can be disabled using BIOS services. ALWAYS - do not allow disabling GA20; this option is useful when any RT code is executed above 1MB."
#string STR_CSM_ZIP_EMULATION_PROMPT    #language eng "ZIP Emulation Type"
#string STR_CSM_ZIP_EMULATION_HELP      #language eng "Sets the Emulation type for ZIP drives"
#string STR_CSM_ZIP_EMULATION_FDD       #language eng "Floppy"
#string STR_CSM_ZIP_EMULATION_HDD       #language eng "Hard Drive"
#string STR_CSM_MODULE_VERSION          #language eng "CSM16 Module Version"
#string STR_CSM_MODULE_VERSION_VALUE    #language eng "N/A, reset required"
#string STR_CSM_SUPPORT_PROMPT          #language eng "CSM Support"
#string STR_CSM_SUPPORT_HELP            #language eng "Enable/Disable CSM Support."



//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**           5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093      **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
